rgregg/esp32-gps/src/Nomaduino_GPS.cpp
  // When we're all done, switch to the GPS mode
  if (hasWiFiConfigured)
  {
    delay(2000);
    if (screenManager) {
      screenManager->showDefaultScreen();
    }
  }
  else
  {
    startConfigPortal();
  }

  TLogPlus::Log.printf("PSRAM Free: %u, Total: %u\n", ESP.getFreePsram(), ESP.getPsramSize());
  TLogPlus::Log.debugln("Initialization complete");
}

void loop()
{
  processSerialInput();
  if (gpsManager) gpsManager->loop();
  if (magnetometerManager)
  {
    magnetometerManager->read();
    // Handle calibration screen mode
    if (magnetometerManager->isCalibrationModeEnabled()) {
      if (screenManager->getScreenMode() != SCREEN_CALIBRATION) {
        screenManager->setScreenMode(SCREEN_CALIBRATION);
      }
    } else if (screenManager->getScreenMode() == SCREEN_CALIBRATION) {
      // If calibration mode is disabled and we are on the calibration screen, go back to default
      screenManager->showDefaultScreen();
    }
  }
  
  if (screenManager) screenManager->loop();
  if (btnRight) btnRight->loop();
  if (btnLeft) btnLeft->loop();
  TLogPlus::Log.loop();
  
  if (isTelnetSetup) telnetSerialStream.loop();

  // Check for WiFi connection and automatically launch portal if needed
  if (isWiFiConfigured && !launchedConfigPortal) {
    if (WiFi.status() != WL_CONNECTED) {
      if (wifiFailureStartTime == 0) {
        // Start tracking WiFi failure time
        wifiFailureStartTime = millis();
        TLogPlus::Log.debugln("WiFi connection lost - starting failure timer");
      } else if (millis() - wifiFailureStartTime > 60000) {  // 60 seconds
        // WiFi has been disconnected for 60 seconds, launch portal
        TLogPlus::Log.infoln("WiFi disconnected for 60+ seconds - launching configuration portal");
        portalLaunchedManually = false;  // Mark as automatically launched
        startConfigPortal();
      } else if (shouldAttemptWiFiConnection()) {
        // Try to reconnect
        TLogPlus::Log.debugln("Reconnect loop - skipping due to debug.");
        // TLogPlus::Log.debugln("Attempting WiFi reconnection");
        // connectToWiFi();
      }
    } else {
      // WiFi is connected, reset failure timer
      if (wifiFailureStartTime != 0) {
        TLogPlus::Log.debugln("WiFi reconnected - resetting failure timer");
        wifiFailureStartTime = 0;
      }
    }

    if (screenManager && screenManager->getScreenMode() == SCREEN_NEEDS_CONFIG)
    {
      
    }
  }


  if (dnsServer) dnsServer->processNextRequest();

  // Check if we're in portal mode and should scan for configured network
  if (launchedConfigPortal && !portalLaunchedManually && isWiFiConfigured && 
      screenManager->getScreenMode() == SCREEN_NEEDS_CONFIG) {
    
    
    // // Only scan for automatically launched portals, and only every 10 seconds
    // if (millis() - lastPortalScanTimer > 10000) {
    //   lastPortalScanTimer = millis();
      
    //   // Check if the configured network is available
    //   String configuredSSID = settings->get(SETTING_WIFI_SSID);
    //   if (!configuredSSID.isEmpty()) {
    //     int scanResult = WiFi.scanComplete();
    //     if (scanResult >= 0) {
    //       // Previous scan completed, check if our network is available
    //       for (int i = 0; i < scanResult; i++) {
    //         if (WiFi.SSID(i) == configuredSSID) {
    //           TLogPlus::Log.infoln("Configured network found in portal mode - attempting to reconnect");
    //           completeConfigurationPortal();
    //           break;
    //         }
    //       }
    //       // Start a new scan for next time
    //       WiFi.scanNetworks(true);
    //     } else if (scanResult == WIFI_SCAN_FAILED) {
    //       // No scan running, start one
    //       WiFi.scanNetworks(true);
    //     }
    //     // If scan is running (WIFI_SCAN_RUNNING), just wait for next cycle
    //   }
    // }
  }

  // Confirm that we're a stagble upgrade if we aren't stuck rebooting.
  if (runtimeDurationMillis > 0 && millis() - runtimeDurationMillis > 60000)
  {
    // Device has been running for 60 seconds, confirm this firmware is stable
    if (esp_ota_mark_app_valid_cancel_rollback() == ESP_OK)
    {
      runtimeDurationMillis = 0;
    }
  }
}

void initScreenManager(bool force)
{
    // Initialize screen manager
  if(force || settings->getBool(USE_DISPLAY, false))
  {
    TLogPlus::Log.debugln("Loading screen manager");
    Display* display;
    ScreenRenderer* renderer;
  #ifdef USE_SH1107_DISPLAY
    display = new SH1107Display();
    display->begin();
    renderer = new MonoScreenRenderer(display, &LittleFS);
  #else
    display = new ST7789Display();
    renderer = new ScreenRenderer(display, &LittleFS);
  #endif
    screenManager = new ScreenManager(settings, display, renderer);
    screenManager->begin();

    if (magnetometerManager) {
      screenManager->setMagnetometerManager(magnetometerManager);
    }
  } else {
    TLogPlus::Log.println("Display output is disabled.");
  }
}

// Button callback functions
void onButtonRightPress(ButtonPressType type) {
  TLogPlus::Log.printf("Right button press: %u\n", type);
  if (screenManager == nullptr) {
    TLogPlus::Log.debugln("screenManager was null - no button action will occur.");
    return;
  }

  if (type == SHORT_PRESS) {
    screenManager->moveScreenInLoop(1);
  } else if (type == LONG_PRESS) {
    // Check if we're on the WiFi screen
    if (screenManager->getScreenMode() == SCREEN_WIFI) {
      TLogPlus::Log.infoln("Long press on WiFi screen - starting configuration portal");
      portalLaunchedManually = true;  // Mark as manually launched
      startConfigPortal();
    }
    // Check if we're in portal mode (SCREEN_NEEDS_CONFIG)
    else if (screenManager->getScreenMode() == SCREEN_NEEDS_CONFIG) {
      // Only exit portal if WiFi is configured
      if (isWiFiConfigured) {
        TLogPlus::Log.infoln("Long press in portal mode - exiting portal and reconnecting to WiFi");
        completeConfigurationPortal();
      } else {
        TLogPlus::Log.infoln("Long press in portal mode ignored - no WiFi configured");
      }
    }
  }
}

void onButtonLeftPress(ButtonPressType type) {
  TLogPlus::Log.printf("Left button press: %u\n", type);
  if (screenManager == nullptr) {
    TLogPlus::Log.debugln("screenManager was null - no button action will occur.");
    return;
  }
  if (type == SHORT_PRESS)
    screenManager->moveScreenInLoop(-1);
  else if (type == LONG_PRESS) {
    if (magnetometerManager) {
      bool calModeEnabled = magnetometerManager->isCalibrationModeEnabled();
      magnetometerManager->setCalibrationModeEnabled(!calModeEnabled);
      if (!calModeEnabled) {
        magnetometerManager->startCalibration();
        TLogPlus::Log.infoln("Magnetometer calibration started via button long press.");
      } else {
        magnetometerManager->stopCalibration();
        TLogPlus::Log.infoln("Magnetometer calibration stopped via button long press.");
      }
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized, cannot start calibration.");
    }
  }
}

void startConfigPortal()
{
  launchedConfigPortal = true;
  TLogPlus::Log.infoln("Starting configuration portal - WiFi AP mode");

  WiFi.mode(WIFI_AP_STA);

  IPAddress apIP(192,168,4,1);
  IPAddress gateway(192,168,4,1);
  IPAddress subnet(255,255,255,0);
  WiFi.softAPConfig(apIP, gateway, subnet);
  WiFi.softAP(fullHostname);
  
