rgregg/esp32-gps/src/Nomaduino_GPS.cpp
  if (!dnsServer) 
  {
    dnsServer = new DNSServer();
  }
  dnsServer->start(53, "*", WiFi.softAPIP());
  TLogPlus::Log.println("DNS Server enabled.");

  configureNetworkDependents(true);

  if (screenManager) {
    screenManager->setPortalSSID(fullHostname);
    screenManager->setScreenMode(SCREEN_NEEDS_CONFIG);
  }
}

void completeConfigurationPortal()
{
  if (!launchedConfigPortal) {
    return;
  }
  launchedConfigPortal = false;
  portalLaunchedManually = false;  // Reset manual launch flag

  TLogPlus::Log.debugln("Shutting down config portal");
  // wifiManager.stopConfigPortal();

  // Clean up the DNS server
  dnsServer->stop();
  delete dnsServer;
  dnsServer = nullptr;

  TLogPlus::Log.debugln("Connecting to wifi");
  wifiFailureStartTime = 0;  // Reset failure timer when exiting portal
  connectToWiFi();
}

void setupTelnetStream()
{
  if (!ENABLE_TELNET)
  {
    TLogPlus::Log.debugln("Telnet logging is disabled.");
    return;
  }
  
  TLogPlus::Log.debugln("Initializing telnet server.");

  telnetSerialStream.setLineMode();
  telnetSerialStream.setLogActions();

  telnetSerialStream.onInputReceived([](String str)
                                     {
                                       processDebugCommand(str); 
                                     });

  telnetSerialStream.onConnect([](IPAddress ipAddress)
                               {
                                 TLogPlus::Log.info("onConnection: Connection from ");
                                 TLogPlus::Log.infoln(ipAddress.toString());
                               });

  telnetSerialStream.onDisconnect([](IPAddress ipAddress)
                                  {
                                    TLogPlus::Log.info("onDisconnect: Disconnection from ");
                                    TLogPlus::Log.infoln(ipAddress.toString());
                                  });
  telnetSerialStream.begin();
  // add telnetSerialStream to log
  TLogPlus::Log.addPrintStream(std::make_shared<TLogPlusStream::TelnetSerialStream>(telnetSerialStream));
  isTelnetSetup = true;
}

void processDebugCommand(String debugCmd)
{
  TLogPlus::Log.debug("Received debug command: ");
  TLogPlus::Log.debugln(debugCmd);

  // Receives a debug command from serial or telnet connection and performs the desired action
  int colonIndex = debugCmd.indexOf(':');
  int spaceIndex = debugCmd.indexOf(' ');
  int splitIndex = -1;
  if (colonIndex != -1 && spaceIndex != -1)
    splitIndex = min(colonIndex, spaceIndex);
  else if (colonIndex != -1)
    splitIndex = colonIndex;
  else if (spaceIndex != -1)
    splitIndex = spaceIndex;

  String cmd;
  String value = "";
  if (splitIndex == -1)
  {
    cmd = debugCmd;
  }
  else
  {
    cmd = debugCmd.substring(0, splitIndex);
    value = debugCmd.substring(splitIndex + 1);
  }

  cmd.toLowerCase();
  if(debugCommands.find(cmd.c_str()) != debugCommands.end())
  {
    debugCommands[cmd.c_str()](value);
  } else {
    TLogPlus::Log.printf("Unrecognized debug command: %s\n", cmd);
  }
}

bool connectToWiFi(bool firstAttempt)
{
  String ssid = settings->get(SETTING_WIFI_SSID);
  String password = settings->get(SETTING_WIFI_PSK);

  if (ssid.isEmpty())
  {
    TLogPlus::Log.warningln("No WiFi SSID configured.");
    isWiFiConfigured = false;
    return false;
  }

  isWiFiConfigured = true;
  
  if (!isWiFiConfigured)
  {
    return false;
  }

  TLogPlus::Log.debugln("Connecting to WiFi");
  lastWiFiConnectionTimer = millis();

  // Configure the hostname
  if (firstAttempt)
  {
    String nameprefix = settings->get(SETTING_WIFI_HOSTNAME, WIFI_HOSTNAME_DEFAULT);
    uint8_t mac[6];
    WiFi.macAddress(mac);
    char mac_cstr[7];
    snprintf(mac_cstr, sizeof(mac_cstr), "%02x%02x%02x", mac[3], mac[4], mac[5]);
    fullHostname = nameprefix + "-" + mac_cstr;
    WiFi.setHostname(fullHostname.c_str());
    TLogPlus::Log.debug("Device hostname: ");
    TLogPlus::Log.debugln(fullHostname);

    WiFi.onEvent(WiFi_Connected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
    WiFi.onEvent(WiFi_GotIPAddress, ARDUINO_EVENT_WIFI_STA_GOT_IP);
    WiFi.onEvent(WiFi_Disconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
    WiFi.setAutoReconnect(false);
  }

  uint32_t freeSpace = ESP.getFreeHeap();
  WiFi.mode(WIFI_STA);

  TLogPlus::Log.info("Attempting to connect to WiFi network: ");
  TLogPlus::Log.infoln(ssid);
  WiFi.begin(ssid.c_str(), password.c_str());
  return true;
}

bool shouldAttemptWiFiConnection()
{
  if (WiFi.status() != WL_DISCONNECTED)
    return false;
  if (screenManager && screenManager->getScreenMode() == SCREEN_NEEDS_CONFIG)
    return false;

  return ((millis() - lastWiFiConnectionTimer) > WIFI_RECONNECT_TIMEOUT);
}

void WiFi_Connected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.debugln("Connected to WiFi");
  wifiFailureStartTime = 0;  // Reset failure timer when connected
}

void WiFi_GotIPAddress(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.println("Got IP: " + WiFi.localIP().toString());
  configureNetworkDependents(true);
}

void configureNetworkDependents(bool connected)
{
  if (connected && !networkServicesInitalized)
  {
    networkServicesInitalized = true;
    // We're on the network with an IP address!
    setupTelnetStream();
    if (!webServerManager) {
      webServerManager = new WebServerManager(settings, gpsManager, screenManager);
      webServerManager->setWiFiConnectCallback([](){ connectToWiFi(); });
      webServerManager->begin();
    }
    if (udpManager != nullptr)
      udpManager->begin();
    TLogPlus::Log.println("Network services enabled");
  }
  else if (!connected && networkServicesInitalized)
  {
    // We don't have an IP address or network connection
    networkServicesInitalized = false;
    isTelnetSetup = false;
    telnetSerialStream.stop();
    if (webServerManager) {
      webServerManager->end();
      delete webServerManager;
      webServerManager = nullptr;
    }
    if (udpManager != nullptr)
      udpManager->stop();
    TLogPlus::Log.println("Network services disabled");
  }
}

void WiFi_Disconnected(WiFiEvent_t wifi_event, WiFiEventInfo_t wifi_info)
{
  TLogPlus::Log.printf("WiFi disconnected; event: %u, reason: %u\n", 
    wifi_event,
    wifi_info.wifi_sta_disconnected.reason);

  configureNetworkDependents(false);
}

String serialBuffer = "";

void processSerialInput()
{
  while (Serial.available() > 0)
  {
    char c = Serial.read();

