rgregg/esp32-gps/src/Nomaduino_GPS.cpp
    if (c == '\b' || c == 127)  // Handle backspace or delete
    {
      if (serialBuffer.length() > 0)
      {
        serialBuffer.remove(serialBuffer.length() - 1);  // Remove last char
        // Erase character visually: backspace, space, backspace
        Serial.print("\b \b");
      }
    }
    else if (c == '\n' || c == '\r')  // Enter pressed
    {
      Serial.println();  // Move to next line on the terminal
      serialBuffer.trim();  // Remove whitespace
      if (serialBuffer.length() > 0)
      {
        processDebugCommand(serialBuffer);
      }
      serialBuffer = "";  // Reset buffer
    }
    else if (isPrintable(c))  // Ignore control characters
    {
      serialBuffer += c;
      Serial.write(c);  // Echo character
    }
  }
}

void initDebugCommands()
{
  debugCommands["sendgpscmd"] = [](String value) { gpsManager->sendCommand(value.c_str()); };
  debugCommands["setgpsbaud"] = [](String value) { gpsManager->changeBaud(value.toInt()); };
  debugCommands["setgpsdata"] = [](String value) { gpsManager->setDataMode((GPSDataMode)value.toInt()); };
  debugCommands["setgpsfix"] = [](String value) { gpsManager->setFixRate((GPSRate)value.toInt()); };
  debugCommands["setgpsrate"] = [](String value) { gpsManager->setRefreshRate((GPSRate)value.toInt()); };
  debugCommands["getgps"] = [](String value) { gpsManager->printToLog(); };
  debugCommands["getheading"] = [](String value) { 
    if (magnetometerManager) {
      TLogPlus::Log.printf("Heading: %f\n", magnetometerManager->getHeading());
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["getmotion"] = [](String value) {
    if (magnetometerManager) {
      TLogPlus::Log.printf("Motion: %s\n", magnetometerManager->isMoving() ? "moving" : "stopped");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["setmagcalmode"] = [](String value) {
    if (magnetometerManager) {
      bool enabled = value.toInt() == 1;
      magnetometerManager->setCalibrationModeEnabled(enabled);
      TLogPlus::Log.printf("Magnetometer calibration mode set to: %s\n", enabled ? "enabled" : "disabled");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["startmagcal"] = [](String value) {
    if (magnetometerManager) {
      magnetometerManager->startCalibration();
      TLogPlus::Log.infoln("Magnetometer calibration started. Move device in a full circle.");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["stopmagcal"] = [](String value) {
    if (magnetometerManager) {
      magnetometerManager->stopCalibration();
      TLogPlus::Log.infoln("Magnetometer calibration stopped. Offsets calculated and saved.");
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["getmagcaloffsets"] = [](String value) {
    if (magnetometerManager) {
      float x, y, z;
      magnetometerManager->getCalibrationOffsets(x, y, z);
      TLogPlus::Log.printf("Magnetometer calibration offsets: X=%f, Y=%f, Z=%f\n", x, y, z);
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };
  debugCommands["setmagcaloffsets"] = [](String value) {
    if (magnetometerManager) {
      // Parse comma-separated values: X,Y,Z
      int firstComma = value.indexOf(',');
      int secondComma = value.indexOf(',', firstComma + 1);
      if (firstComma != -1 && secondComma != -1) {
        float x = value.substring(0, firstComma).toFloat();
        float y = value.substring(firstComma + 1, secondComma).toFloat();
        float z = value.substring(secondComma + 1).toFloat();
        magnetometerManager->setCalibrationOffsets(x, y, z);
        TLogPlus::Log.printf("Magnetometer calibration offsets set to: X=%f, Y=%f, Z=%f\n", x, y, z);
      } else {
        TLogPlus::Log.warningln("Invalid format for setmagcaloffsets. Use X,Y,Z");
      }
    } else {
      TLogPlus::Log.warningln("Magnetometer not initialized");
    }
  };

  debugCommands["refresh"] = [](String value) { if (screenManager) screenManager->refreshScreen(); };
  debugCommands["backlight"] = [](String value) { if (screenManager) screenManager->setBacklight((uint8_t)value.toInt()); };
  debugCommands["setscreenmode"] = [](String value) { if (screenManager) screenManager->setScreenMode((ScreenMode)value.toInt()); };
  debugCommands["setwifi"] = [](String value) { settings->set(SETTING_WIFI_SSID, value); };
  debugCommands["setpassword"] = [](String value) { settings->set(SETTING_WIFI_PSK, value); };
  debugCommands["getwifi"] = [](String value) { 
    TLogPlus::Log.infoln("Printing WiFi information");
    TLogPlus::Log.printf("Status: %u\n", WiFi.status());
    TLogPlus::Log.println("IP: " + WiFi.localIP().toString());
    TLogPlus::Log.printf("Base Station ID: %s\n", WiFi.BSSIDstr().c_str());
    TLogPlus::Log.printf("SSID: %s\n", WiFi.SSID().c_str());
    TLogPlus::Log.printf("RSSI: %i\n", WiFi.RSSI()); 
  };
  debugCommands["reconnect"] = [](String value) { connectToWiFi(); };

  debugCommands["setsettings"] = [](String value) { settings->load(value); };
  debugCommands["getsettings"] = [](String value) { settings->printToLog(); };
  debugCommands["setflag"] = [](String value) { settings->setBool(value.c_str(), true); };
  debugCommands["clearflag"] = [](String value) { settings->setBool(value.c_str(), false); };
  debugCommands["reboot"] = [](String value) { ESP.restart(); };

  debugCommands["setudphost"] = [](String value) { 
    udpManager->setDestHost(value.c_str());
    settings->set(SETTING_UDP_HOST, value); 
  };
  debugCommands["setudpport"] = [](String value) { 
    udpManager->setDestPort(value.toInt());
    settings->setInt(SETTING_UDP_PORT, value.toInt());
  };

  debugCommands["help"] = [](String value) {
    TLogPlus::Log.println("Valid debug commands are:");
    for (const auto& pair : debugCommands) {
      TLogPlus::Log.println(pair.first.c_str());
    }
  };
  debugCommands["getlog"] = [](String value) {
    bufferedLogs->printAll(Serial);
    if (isTelnetSetup) {
      bufferedLogs->printAll(telnetSerialStream);
    }
    TLogPlus::Log.println("End of log");
  };
  debugCommands["getgpsdata"] = [](String value) {
    if (gpsManager) {
      gpsManager->receivedSentences(Serial);
      if (isTelnetSetup) {
        gpsManager->receivedSentences(telnetSerialStream);
      }
    }
    TLogPlus::Log.println("End of data");
  };
  debugCommands["scani2c"] = [](String value) {
    ScanI2CBus();
  };
  debugCommands["initscreen"] = [](String value) {
    initScreenManager(true);
  };
}


void ScanI2CBus() {
  TLogPlus::Log.println("I2C device scan...");

  byte error, address;
  int devices = 0;

  for (address = 0x01; address < 0x7F; address++) {
    Wire.beginTransmission(address);
    error = Wire.endTransmission();

    if (error == 0) {
      TLogPlus::Log.printf("I2C device found at address 0x%02X\n", address);
      devices++;
    } else if (error == 4) {
      TLogPlus::Log.printf("Unknown error at address 0x%02X\n", address);
    }
    TLogPlus::Log.print('.');
  }

  if (devices == 0)
    TLogPlus::Log.println("No I2C devices found\n");
  else
    TLogPlus::Log.println("Scan complete\n");
}